package CodeWars.Eight.Deside;
/*
/*
Make a simple function called greet that returns the most-famous "hello world!".

Style Points
Sure, this is about as easy as it gets. But how clever can you be to create the most creative "hello world" you can think of? What is a "hello world" solution you would want to show your friends?

Создайте простую функцию под названием «приветствие», которая возвращает самое известное «привет, мир!».
Очки стиля
Конечно, это настолько просто, насколько это возможно. Но насколько вы умны, чтобы создать самый креативный «привет, мир», который только можно придумать? Какое решение «привет, мир» вы бы хотели показать своим друзьям?
*/


public class SimpleFuncHello {
    public static void main(String[] args) {
        String first = "hello ";
        String second = "world!";

        String greet = first + second;
        System.out.println(greet);

    }
}

