package Alishev;

/*
* Вывести на экран слово “JAVA”, в строку, чтобы оно повторилось 10 раз, используя
цикл while.
Вывод в консоль должен быть таким:
JAVA JAVA JAVA JAVA JAVA JAVA JAVA JAVA JAVA JAVA*/

public class Ex1 {
    public static void main(String[] args) {
        System.out.println("1");

    }
}
